In [1]:
import pandas as pd
import numpy as np
import datetime

# Label Encoding

In [10]:
today_date = datetime.datetime.today()

In [11]:
today_date

datetime.datetime(2021, 5, 17, 12, 1, 59, 679180)

In [13]:
today_date - datetime.timedelta(1)

datetime.datetime(2021, 5, 16, 12, 1, 59, 679180)

In [51]:
days = [today_date - datetime.timedelta(x) for x in range(15)]

In [52]:
data = pd.DataFrame(days,columns=['datetime'])

In [53]:
data.head()

                    datetime
0 2021-05-17 12:01:59.679180
1 2021-05-16 12:01:59.679180
2 2021-05-15 12:01:59.679180
3 2021-05-14 12:01:59.679180
4 2021-05-13 12:01:59.679180

In [64]:
data['weekday'] = data['datetime'].dt.day_name()

In [80]:
data

                     datetime    weekday
0  2021-05-17 12:01:59.679180     Monday
1  2021-05-16 12:01:59.679180     Sunday
2  2021-05-15 12:01:59.679180   Saturday
3  2021-05-14 12:01:59.679180     Friday
4  2021-05-13 12:01:59.679180   Thursday
5  2021-05-12 12:01:59.679180  Wednesday
6  2021-05-11 12:01:59.679180    Tuesday
7  2021-05-10 12:01:59.679180     Monday
8  2021-05-09 12:01:59.679180     Sunday
9  2021-05-08 12:01:59.679180   Saturday
10 2021-05-07 12:01:59.679180     Friday
11 2021-05-06 12:01:59.679180   Thursday
12 2021-05-05 12:01:59.679180  Wednesday
13 2021-05-04 12:01:59.679180    Tuesday
14 2021-05-03 12:01:59.679180     Monday

In [82]:
dic = {'Monday':1, 'Tuesday':2, 'Wednesday':3,'Thursday':4,'Friday':5,'Saturday':6, 'Sunday':7}

In [83]:
data['weekday_ordinal'] = data['weekday'].map(dic)

In [84]:
data.head()

                    datetime   weekday  weekday_ordinal
0 2021-05-17 12:01:59.679180    Monday                1
1 2021-05-16 12:01:59.679180    Sunday                7
2 2021-05-15 12:01:59.679180  Saturday                6
3 2021-05-14 12:01:59.679180    Friday                5
4 2021-05-13 12:01:59.679180  Thursday                4

# Count or Frequency Encoding

In [96]:
df = pd.read_csv('https://raw.githubusercontent.com/krishnaik06/Feature-Engineering-Live-sessions/master/mercedes.csv',usecols=['X1','X2','X3'])

In [97]:
df.head()

  X1  X2 X3
0  v  at  a
1  t  av  e
2  w   n  c
3  t   n  f
4  v   n  f

In [98]:
for c in df.columns:
    print(c, ':', len(df[c].unique()))

X1 : 27
X2 : 44
X3 : 7

# Count

In [101]:
X2_map = df['X2'].value_counts().to_dict()

In [102]:
df['X2'] = df['X2'].map(X2_map)

In [103]:
df.head()

  X1   X2 X3
0  v    6  a
1  t    4  e
2  w  137  c
3  t  137  f
4  v  137  f

# Frequency

In [109]:
X1_map = (df.groupby('X1').size()/len(df)).to_dict()

In [110]:
df['X1'] = df['X1'].map(X1_map)

In [111]:
df.head()

         X1   X2 X3
0  0.096935    6  a
1  0.007365    4  e
2  0.012354  137  c
3  0.007365  137  f
4  0.096935  137  f

# Target Guided Ordinal Encoding

In [182]:
df = pd.read_csv('https://raw.githubusercontent.com/krishnaik06/Feature-Engineering-Live-sessions/master/titanic.csv',usecols=['Cabin','Survived'])

In [183]:
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [184]:
df.Cabin.fillna('Missing',inplace=True)

In [185]:
df.head()

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing

In [186]:
df['Cabin'] = df.Cabin.str[0]

In [187]:
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [140]:
df.Cabin.unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [145]:
labels = df.groupby('Cabin')['Survived'].mean().sort_values().index

In [147]:
labels

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [155]:
labels_dict = {k:i for i,k in enumerate(labels,0)}

In [158]:
df.Cabin = df.Cabin.map(labels_dict)

In [159]:
df.head()

   Survived  Cabin
0         0      1
1         1      4
2         1      1
3         1      4
4         0      1

# Mean Encoding

In [188]:
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [189]:
labels = df.groupby('Cabin')['Survived'].mean().to_dict()

In [191]:
df.Cabin = df.Cabin.map(labels)

In [192]:
df.head()

   Survived     Cabin
0         0  0.299854
1         1  0.593220
2         1  0.299854
3         1  0.593220
4         0  0.299854